wegam/STM32F1xWorkSpace/Examples/HC/PC004V21.C
#ifdef PC004V21				//单元控制板

#include "PC004V21.H"


#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"


#include "STM32_CAN.H"
#include "STM32_USART.H"
#include "STM32_TOOLS.H"		//数据校验工具


#include "string.h"				//串和内存操作函数头文件

/*##############################################################################
################################################################################
# 项目名		:	MS0800_PC004V10	
# 功能描述	:	智能药架单元板
-------------------------------------------------------------------------------	
********************************功能说明***************************************
-------------------------------------------------------------------------------
● 与网关板通讯，传达指令到数码管显示板，
● 显示地址：柜机号
● 拔码方式：
● CAN通讯说明：
	波特率：	100K
	公有地址：0X000
	
● 485通讯说明：485与网关板通讯
	波特率：	9600
	串口号：	USART2
	控制脚：	PA1
	头码：		0XFA,0XFB
	私有地址：拔码开关地址
-------------------------------------------------------------------------------
********************************软件流程***************************************
-------------------------------------------------------------------------------
1）配置项目
2）上电后主动获取单元地址
3）	
4）	
5）	
-------------------------------------------------------------------------------
*****************************指令/协议说明*************************************
-------------------------------------------------------------------------------

--------------------------------CAN协议----------------------------------------
1.1）	CAN协议：				与数码管板通讯
			CAN—ID：					0X3FF(StdId=0X3FF;)
			长度：						3	(DLC=1;)
			层时间同步：			0XAA;(Data[0]=0XAA;)
			获取/显示ID指令：	0X01;(Data[0]=0X01;)
			自检指令：				0X02;(Data[0]=0X02;)
			熄屏指令：				0X03;(Data[0]=0X02;)
-------------------------------------------------------------------------------		
1.2）	数码管板上报地址：设定完数码管板ID后往单元板上他地址
			CAN—ID：			SW_ID（拔码开关地址）
			长度：				1	(DLC=1;)
			层时间同步：	0XAA;(Data[0]=0XAA;)
		
1.3）	数码管板接收数据：接收上级单元板数据，显示或者关闭
			CAN—ID：			SW_ID（拔码开关地址）
			长度：					3	(DLC=3;)
			数据显示标识：	0X08;(Data[0]=0X08;)
			显示数据内容：	最大显示999
										高位8位：Data[1]
										低位8位：Data[2]
									
1.4）	数码管板应答：数据完板接收到正确的数据后的回执
			CAN—ID：			SW_ID（拔码开关地址）
			长度：					1	(DLC=1;)
			层时间同步：		0XA0;(Data[0]=0XA0;)
--------------------------------485协议----------------------------------------
2.1）	485协议：			与网关板通讯
			数据长度：	13Byte
			RS232通讯说明：			FA F5 01 01 BCC8 00 06 01 01 01 00 01 25------->FA F5 01 01 27 00 06 01 01 01 00 01 25
//			格式：			HEAD(2)，命令，柜号，单元号，数值高位，数值低位，异或校验
			说明：
			HEAD:				0XFA,0XFB
			命令：			0X00--关闭显示，0X01--显示数值，0x02--获取连接设备地址（柜号和单元号）,0x03--显示单元ID，
			柜号：			单元柜号，1~0XFF
			单元号：		数码管ID号，10~77
			数值高位：	与低位连接
			数值低位：	与高位连接，连接后取值范围：0~999，数码管只有三位
			异或校验：	Byte0~Byte6校验
			接收数据单元无误，回执位为0X80|命令类型
			接收数据单元地址错误：回执位0XE0|命令类型
-------------------------------------------------------------------------------


********************************************************************************

################################################################################
###############################################################################*/

#define RS485TX	0
#define RS485RX	1
#define PC004V10_RS4851_CTL(n)	if(n==RS485RX){GPIO_ResetBits(GPIOA,GPIO_Pin_1);}else{GPIO_SetBits(GPIOA,GPIO_Pin_1);}

//************CAN通讯数据
#define	CAN_ID				PC004V10_Num[8]*10+PC004V10_Num[9]		//单元地址	由两位数合并，十位为层，个位为序号
#define	CAN_Command		PC004V10_Num[5]												//命令类型----上位机用户码
#define	Data_H				PC004V10_Num[11]											//数据高位
#define	Data_L				PC004V10_Num[12]											//数据低位

//#define	PC002Test			//智能药盒主控板测试
#define	USART_TO_485	//USART与RS485互转
//#define	PD002TEST				//称重控制板测试
//#define	PD003V11TEST		//智能药盒测试
//#define	PD014V15TEST		//盒剂控制板测试
//#define	PD011V20TEST		//八路电机控制板测试
//************485通讯数据
//#define	

#define	PC004V10_BufferSize 1024															//DMA1缓冲大小

//u8 RxBuffer[PC004V10_BufferSize]={0};								//RS485缓存
//u8 ReBuffer[PC004V10_BufferSize]={0};								//RS485缓存

u8 RS485RxB[PC004V10_BufferSize]={0};								//RS485缓存
u8 RS485RvB[PC004V10_BufferSize]={0};								//RS485缓存
u8 RS485Txd[PC004V10_BufferSize]={0};								//RS485缓存

u8 USART1Rxd[PC004V10_BufferSize]={0};								//RS485缓存
u8 USART1Txd[PC004V10_BufferSize]={0};								//RS485缓存

u8 PC004V10_Buffer[PC004V10_BufferSize]={0};								//RS485缓存
u8 PC004V10_TBuffer[PC004V10_BufferSize]={0};								//RS485缓存
u8 PC004V10_Num[13]={0};																		//接收到的数据
u8 PC004V10_CANBuffer[8]={0};																//接收到的数据

u8 ID_ARR[8][8]={0,0};			//存储已连接数码管ID列表
u8 ON_line[8][8]={0,0};			//对应ID列表标志位，0--无此ID，1--有对应ID

u8 SwitchID=0;				//拔码开关地址 //单元板ID----从右到左依次为增高，最右边为最低位
u8 SwitchIDBAC=0xFF;			//ID备份---ID变化时更新
u8 NumW=0;				//槽号--MS拨码为槽号
u8 NumF=0;				//发药数量--LS拨码为发药数量

u16	SYSTime=0;							//循环计时变量
u8 Buzzer_time=0;						//开机蜂鸣器响应次数

u8 Self_Dsp=0;							//拔码开关为0时，自检测试显示标识变量

u16 num=0;
u8 PB1Flg=0;
u8 PW1Flg=0;
u16 KeyTime=0;

RS485_TypeDef  RS485B;			//连接到下级接口485
RS485_TypeDef  RS485A;			//连接到上级接口485
CanRxMsg RxMessage;
CanTxMsg TxMessage;

u8 RxData	=	0;
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PC004V21_Configuration(void)
{
	
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H
	
	GPIO_DeInitAll();							//将所有的GPIO关闭----V20170605
	
	PC004V21_PinSet();
	
	SysTick_Configuration(500);	//系统嘀嗒时钟配置72MHz,单位为uS
	
//	IWDG_Configuration(1000);			//独立看门狗配置---参数单位ms	
	
	PWM_OUT(TIM2,PWM_OUTChannel1,1,900);						//PWM设定-20161127版本
//	PWM_OUT(TIM3,PWM_OUTChannel3,0.5,5);						//PWM设定-20161127版本
	
	PD002V30_USART_Cofiguration();
	
	CAN_Configuration_NR(100000);										//CAN配置---标志位查询方式，不开中断
	
	CAN_FilterInitConfiguration_StdData(0X01,0X001,0X001);			//CAN滤波器配置---标准数据帧模式

	
	PC004V10_Num[8]=1;
	PC004V10_Num[9]=0;
	PC004V10_Num[11]=0;
	PC004V10_Num[12]=0;
	
	PC004V10_TBuffer[0]=0x00;
	PC004V10_TBuffer[1]=0x05;
	PC004V10_TBuffer[2]=0x03;
	PC004V10_TBuffer[3]=0x03;
	PC004V10_TBuffer[4]=0x00;
	PC004V10_TBuffer[5]=0x00;
	PC004V10_TBuffer[6]=0x00;
	PC004V10_TBuffer[7]=0x00;
	PC004V10_TBuffer[8]=0x00;
	PC004V10_TBuffer[9]=0x00;
	
	PC004V10_TBuffer[10]=BCC8(PC004V10_TBuffer,10);		//异或校验
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PC004V21_Server(void)
{
	//循环周期1mS
	IWDG_Feed();								//独立看门狗喂狗
	
#ifdef PD002TEST			//称重控制板测试
	PD002VXXFUN();			//称重控制板测试
	return;
#endif
#ifdef PD003V11TEST		//智能药盒测试
	PD003V11FUN();
	return;
#endif
#ifdef PD011V20TEST		//智能药盒测试
	PD011V20FUN();			//八路电机控制板测试
	return;
#endif
#ifdef USART_TO_485
	USART2RS485();			//USART与RS485互转
	return;
#endif	
	
#ifdef PC002Test
	PC002VxxFUN();			//智能药盒主控板测试
	return;
#endif
#ifdef PD014V15TEST
	PD014V15FUN();			//盒剂控制板测试
	return;
#endif

