wegam/STM32F1xWorkSpace/Examples/HC/PC004V21.C
//	if(RxData>=250)
//	{
//		RxData=0;
//	}
//	status	=	RS485_ReadBufferIDLE(&RS485B,RS485RvB);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
//	if(status)
//	{
//		RxData+=1;
//	}
//	if(SYSTime	==500)
//	{
//		SYSTime	=	0;
//		RxData+=1;
//		RS485_DMASend(&RS485B,&RxData,1);	//RS485-DMA发送程序
//		SysTick_DeleymS(5);				//SysTick延时nmS
//		return;
//	}
	
	SwitchID=PC004V21_GetSwitchID();	//获取当前设备ID//机柜号
	NumW=((SwitchID>>4)&0x0F)|(SwitchID<<1&0x10);			//MS拨码为槽号（HSH,右边最低位）
	NumF=SwitchID&0x07;														//发药数量--LS拨码为发药数量（HSL拨码)
//	SwitchIDBAC=0xFF;								//ID备份---ID变化时更新
	if(SwitchIDBAC!=SwitchID)
	{		
		SwitchIDBAC=SwitchID;		//更新备份
		PC004V10_TBuffer[0]=0x00;		//0xFF,NumW,NumF
		PC004V10_TBuffer[1]=0xFF;		//0xFF,NumW,NumF
		PC004V10_TBuffer[2]=NumW;		//0xFF,NumW,NumF
		PC004V10_TBuffer[3]=NumF;		//0xFF,NumW,NumF
		RS485_DMASend	(&RS485B,PC004V10_TBuffer,4);	//RS485-DMA发送程序
//		RS485_DMAPrintf(&RS485_Conf,"请求更新，发药槽号:%d,发药数量：%d",NumW,NumF);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
	}
	if(SYSTime	==500)
	{
		RS485_DMASend(&RS485B,PC004V10_TBuffer,11);	//RS485-DMA发送程序		
	}
	else
	{
		RS485_ReadBufferIDLE			(&RS485B,RS485RvB);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	}
//	return;
	if(SYSTime>=1000)
	{
		SYSTime=0;
		num++;
		if(num>5)
		{
			num=0;
//			RS485_DMASend(&RS485_Conf,(u32*)PC004V10_TBuffer,11);	//RS485-DMA发送程序
		}
//		GPIO_Toggle	(GPIOB,GPIO_Pin_0);		//将GPIO相应管脚输出翻转----V20170605//锁接口
//		TxMessage.Data[3]=num;
//		PC004V10_CAN_COMMAD();					//CAN发送命令函数，地址，命令类型，数据--时间同步--发送获取D命令
//		PC004V10_Num[0]=num;
//		CAN_StdTX_DATA(0X15,1,PC004V10_Num);			//CAN使用标准帧发送数据
//		CAN_ExtTX_DATA(0X15,1,PC004V10_Num);			//CAN使用扩展帧发送数据
	}
	if(PB1in)		//无按键
	{	
		if(KeyTime>=10&&KeyTime<3000)	//短按键
		{			
			if(PB1Flg==0)
					PB1Flg=1;
		}
		else if(KeyTime>=3000)	//长按
		{
			if(PB1Flg==0)
					PB1Flg=2;
		}
		KeyTime=0;
	}
	else
	{		
		if(KeyTime<=5000)
		{
			KeyTime++;
		}
	}
	if(PB1Flg==2)	//长按
	{
		PC004V10_CANBuffer[0]=0x01;		//命令:0x01查询槽位信息，0x02发药命令
		
		PC004V10_TBuffer[0]=0x01;
		
		RS485_DMASend(&RS485B,PC004V10_TBuffer,1);	//RS485-DMA发送程序
		CAN_StdTX_DATA(0x01,0x08,PC004V10_CANBuffer);			//CAN使用标准帧发送数据
		
		PB1Flg=0;
	}
	if(PB1Flg==1)
	{		
//		PC004V21_KEYData();		//按键发药处理函数
		PC004V10_CANBuffer[0]=0x02;		//命令:0x01查询槽位信息，0x02发药命令
		PC004V10_CANBuffer[1]=NumW;		//槽号
		PC004V10_CANBuffer[2]=NumF;		//数量
		
		PC004V10_TBuffer[0]=0x02;
		PC004V10_TBuffer[1]=NumW;
		PC004V10_TBuffer[2]=NumF;
		RS485_DMASend(&RS485B,PC004V10_TBuffer,3);	//RS485-DMA发送程序
//		RS485_DMAPrintf(&RS485B,"%d,%d",NumW,NumF);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
		CAN_StdTX_DATA(0x01,0x08,PC004V10_CANBuffer);			//CAN使用标准帧发送数据
		if(PW1Flg==0)
		{
			PW1Flg=1;
			PB1Flg=0;				
//			PWM_OUT(TIM3,PWM_OUTChannel3,0.5,10);						//PWM设定-20161127版本
		}
		else
		{
			PW1Flg=0;
			PB1Flg=0;
//			PWM_OUT(TIM3,PWM_OUTChannel3,5,500);						//PWM设定-20161127版本
		}
	}
	if(CAN_RX_DATA(&RxMessage))
	{
		if(RxMessage.Data[0]==0x81)
		{
			PC004V10_TBuffer[0]=RxMessage.Data[0];	//返回代码类型
			PC004V10_TBuffer[1]=RxMessage.Data[1];
			PC004V10_TBuffer[2]=RxMessage.Data[2];
			PC004V10_TBuffer[3]=RxMessage.Data[3];	
			PC004V10_TBuffer[4]=RxMessage.Data[4];	
			PC004V10_TBuffer[5]=RxMessage.Data[5];	//错误类型
			RS485_DMASend(&RS485B,PC004V10_TBuffer,6);	//RS485-DMA发送程序
			
		}
		if(RxMessage.StdId==0x01)
		{
			PC004V10_TBuffer[0]=RxMessage.Data[0];	//返回代码类型
			PC004V10_TBuffer[1]=RxMessage.Data[1];
			PC004V10_TBuffer[2]=RxMessage.Data[2];
			PC004V10_TBuffer[3]=RxMessage.Data[3];	//错误类型
			RS485_DMASend(&RS485B,PC004V10_TBuffer,4);	//RS485-DMA发送程序
		}
	}
	//**************检查通讯标志位，查看是否为通讯中断，如果是，则此次时间增量无效
//	status=PC004V10_485_TR();				//485收发程序//通讯接口
//	if(status&&(SYSTime>0))
//		SYSTime--;	
	
	
//	
//	//**************检测设备ID有无变化，有就更新
//	if(SYSTime%500==0)
//	{
//		if(SwitchID!=PC004V21_GetSwitchID())
//		{
//			SwitchID=PC004V21_GetSwitchID();
//			PC004V10_Buffer[5]=0x01;							//获取ID指令0x01
//			PC004V10_CAN_COMMAD();					//CAN发送命令函数，地址，命令类型，数据--时间同步--发送获取D命令
//		}
//	}
//	if(SwitchID==0)
//	{
//		Self_Test(SYSTime);
//	}
//	PC004V10_CAN_RX();									//主要接收数码管板地址，
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PC004V21_PinSet(void)
{
	//********************RS485_CTL配置
	GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_1);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	
	GPIO_Configuration_OPP50(GPIOB,GPIO_Pin_0);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605//锁接口
	
	GPIO_Configuration_INF(GPIOB,GPIO_Pin_1);						//将GPIO相应管脚配置为浮空输入模式----V20170605
	
	//********************拔码开关配置
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_0);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_1);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_2);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_3);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_4);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_5);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_6);						//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(GPIOC,GPIO_Pin_7);						//将GPIO相应管脚配置为上拉输入模式----V20170605
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PD002V30_USART_Cofiguration(void)
{
	RS485B.USARTx=UART4;
	RS485B.RS485_CTL_PORT=GPIOC;
	RS485B.RS485_CTL_Pin=GPIO_Pin_12;
	
	RS485A.USARTx	=	USART2;
	RS485A.RS485_CTL_PORT	=	GPIOA;
	RS485A.RS485_CTL_Pin	=	GPIO_Pin_1;
	
	RS485_DMA_ConfigurationNR	(&RS485B,19200,PC004V10_BufferSize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	
	USART_DMA_ConfigurationNR	(USART1,115200,PC004V10_BufferSize);	//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
* 函数名			:	PC004V21_KEYData
* 功能描述		:	按键发药处理函数 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PC004V21_KEYData(void)		//按键发药处理函数
{
	unsigned char SW=PC004V21_GetSwitchID();				//获取当前设备ID//机柜号(高位当发药头号，低位当发药数量）

	
	PC004V10_TBuffer[0]=0x00;			//B0-SWITCHID
	PC004V10_TBuffer[1]=0x03;			//B1-CMD命令
//	PC004V10_TBuffer[2]=0x03;
//	PC004V10_TBuffer[3]=0x03;
//	PC004V10_TBuffer[4]=0x00;
//	PC004V10_TBuffer[5]=0x00;
//	PC004V10_TBuffer[6]=0x00;
//	PC004V10_TBuffer[7]=0x00;
//	PC004V10_TBuffer[8]=0x00;
//	PC004V10_TBuffer[9]=0x00;
	
	memset(&PC004V10_TBuffer[2],0x00,8);		//所有发药头发药数量设置为0
	
	PC004V10_TBuffer[2+(SW>>4)]=SW&0x0F;		//传入数据
	
	PC004V10_TBuffer[10]=BCC8(PC004V10_TBuffer,10);		//异或校验
	
	RS485_DMASend(&RS485B,PC004V10_TBuffer,11);	//RS485-DMA发送程序
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
u8 PC004V10_485_TR(void)				//485收发程序//通讯接口
{
	//***********串口状态检测控制485脚为接收方式
	u16 num=0;
//	u8 temp=0;
//	num=USART_RX_FlagClear(USART2);						//清除串口DMA发送全局中断标志
	//1)**********对接收到的数据进行规格检测
	if(num)
	{	
		//1.1)**********RS485转发发送模式，防止有数据进来干扰数据
		PC004V10_RS4851_CTL(RS485TX);						//485在发送模式，不接收数据
		PC004V10_delay(2000);										//延时，使得485收发控制引脚电平正确转换
		//1.3)**********命令类信息
		if((PC004V10_Buffer[0]==0xFA)&&(PC004V10_Buffer[1]==0xF5)&&(PC004V10_Buffer[2]==0x05)&&(PC004V10_Buffer[3]==0x0A))
		{
			if(PC004V10_Buffer[5]==0x04)					//更新ID指令
			{
				memset(ID_ARR,0,sizeof(ID_ARR));		//清空地址存储空间
				memset(ON_line,0,sizeof(ON_line));	//清空地址在线标志
			}
			PC004V10_CAN_COMMAD();								//CAN发送命令函数，地址，命令类型，数据--时间同步
			PC004V10_RS4851_CTL(RS485RX);					//485转为接收模式
		}
		//1.2)**********检查数据正确性
		else if((PC004V10_Buffer[0]==0xFA)&&(PC004V10_Buffer[1]==0xF5)&&(PC004V10_Buffer[7]==SwitchID)&&((PC004V10_Buffer[4]==BCC8(&PC004V10_Buffer[7],6))))			//检测头标识、机柜号和异或校验位
		{
//			/********************************************/
//			//***************判断单元地址正确与否
			u8 temp=0;
			temp=PC004V10_Buffer[8]*10+PC004V10_Buffer[9];						//将单元地址的层号和序号合成
			//1.2.1）***************判断单元地址正确与否
			if(memchr(ID_ARR,temp,sizeof(ID_ARR)))										//单元地址正确	//判断单元地址有没存在，在数组x的前n个字节中搜索字符ch。返回值为指向s中首次出现ch的指针位置。如果ch没有在s数组中出现。返回NULL			
			{
				memcpy(PC004V10_Num,PC004V10_Buffer,13);								//复制数据						

