wegam/STM32F1xWorkSpace/Examples/HC/PC004V21.C
				PC004V10_Buffer[3]|=0x80;						//修改回执位
				USART_DMASend(USART2,PC004V10_Buffer,(u32)num);		//返回回执给网关板
				
				PC004V10_CAN_TX();					//CAN发送数据，地址，命令类型，数据
			}
			else		//单元地址错误
			{
				PC004V10_Buffer[3]|=0xE0;																//修改回执位
				USART_DMASend(USART2,PC004V10_Buffer,(u32)num);		//返回回执给网关板
			}
			/**********************************************/
		}
		
		else			//接收数据无效，恢复485为接收数据状态
		{
			memset(PC004V10_Buffer,0,PC004V10_BufferSize);	//初始化缓冲
			PC004V10_RS4851_CTL(RS485RX);										//485转为接收模式			
		}
		return 1;		
	}
	//2)**********根据串口2DMA发送完成中断
//	else if(USART_TX_DMAFlagClear(USART2))
//	{
//		memset(PC004V10_Buffer,0,PC004V10_BufferSize);			//初始化缓冲		
//		return 1;
//	}
	//3)**********数据发送完成后将485控制脚拉低转为接收模式
	else	if(USART_GetFlagStatus(USART2,USART_FLAG_TC)==SET)
	{
		PC004V10_RS4851_CTL(RS485RX);
		USART_ClearFlag(USART2,USART_FLAG_TC);
		return 0;
	}
	else
	{
		return 0;
	}
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_CAN_RX(void)									//主要接收数码管板地址，
{
	u8 ID_Temp=0;
	if(SET == CAN_GetITStatus(CAN_IT_FF0))
	{
		CAN_ClearITPendingBit(CAN_IT_FF0);
	}
	else if(SET == CAN_GetITStatus(CAN_IT_FOV0))
	{
		CAN_ClearITPendingBit(CAN_IT_FOV0);
	}
	else if(SET == CAN_GetITStatus(CAN_IT_FMP0))
	{
		CAN_ClearITPendingBit(CAN_IT_FMP0);
	}
	else
	{
		CAN_Receive(CAN_FIFO0,&RxMessage);
		if(RxMessage.DLC==1&&RxMessage.Data[0]==0XAA)
		{
			ID_Temp=RxMessage.StdId;
			ID_ARR[ID_Temp/10][ID_Temp%10]=ID_Temp;
			ON_line[ID_Temp/10][ID_Temp%10]=1;
		}
	}
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_CAN_TX(void)					//CAN发送数据，地址，命令类型，数据
{
	CanTxMsg TxMessage;
	
	u8	TransmitMailbox = 0;
	u32	i;

	TxMessage.StdId=CAN_ID;					//标准帧ID
//	TxMessage.ExtId=0XFF;					//扩展帧ID
	TxMessage.RTR=CAN_RTR_DATA;			//数据帧
	TxMessage.IDE=CAN_ID_STD;				//使用标准标识符
	TxMessage.DLC=8;
	TxMessage.Data[0]=CAN_Command;	//命令类型
	TxMessage.Data[1]=Data_H;				//数据高位
	TxMessage.Data[2]=Data_L;				//数据低位
	TxMessage.Data[3]=0x03;
	TxMessage.Data[4]=0x04;
	TxMessage.Data[5]=0x05;
	TxMessage.Data[6]=0x06;
	TxMessage.Data[7]=0x07;
	TransmitMailbox = CAN_Transmit(&TxMessage);
	i = 0;
	// 用于检查消息传输是否正常
	while((CAN_TransmitStatus(TransmitMailbox) != CANTXOK) && (i != 0xFF))
	{
		i++;
	}
	i = 0;
	// 检查返回的挂号的信息数目
	while((CAN_MessagePending(CAN_FIFO0) < 1) && (i != 0xFF))
	{
		i++;
	}
}
/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_CAN_COMMAD(void)					//CAN发送命令函数，地址，命令类型，数据--时间同步
{
//	CanTxMsg TxMessage;
	
	u8	TransmitMailbox = 0;
	u32	i;

	TxMessage.StdId=0X3FF;							//标准帧ID
	TxMessage.ExtId=0X3F5;						//扩展帧ID
	TxMessage.RTR=CAN_RTR_DATA;					//数据帧
	TxMessage.IDE=CAN_ID_EXT;						//使用扩展帧标识符
	TxMessage.DLC=4;
	TxMessage.Data[0]=PC004V10_Buffer[5];	//命令类型
	TxMessage.Data[1]=0x00;						//数据高位
	TxMessage.Data[2]=0x00;						//数据低位
//	TxMessage.Data[3]=0x00;
//	TxMessage.Data[4]=0x00;
//	TxMessage.Data[5]=0x00;
//	TxMessage.Data[6]=0x00;
//	TxMessage.Data[7]=0x00;
	TransmitMailbox = CAN_Transmit(&TxMessage);
	i = 0;
	// 用于检查消息传输是否正常
	while((CAN_TransmitStatus(TransmitMailbox) != CANTXOK) && (i != 0xFF))
	{
		i++;
	}
	i = 0;
	// 检查返回的挂号的信息数目
	while((CAN_MessagePending(CAN_FIFO0) < 1) && (i != 0xFF))
	{
		i++;
	}
	memset(PC004V10_Buffer,0,PC004V10_BufferSize);	//初始化缓冲
}

/*******************************************************************************
*函数名		:	function
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
u8 PC004V21_GetSwitchID(void)
{
	u8	SW_ID=0;
	//1)***************获取H拔码开关地址，从右到左为从低到高
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_4))		//SWH-1
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5))		//SWH-2
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_6))		//SWH-3
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_7))		//SWH-4
	{
		SW_ID|=1;
	}
	
	//2)***************获取L拔码开关地址，从右到左为从低到高
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0))		//SWL-1
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_1))		//SWL-2
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_2))		//SWL-3
	{
		SW_ID|=1;
	}
	SW_ID<<=1;
	if(!GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_3))		//SWL-4
	{
		SW_ID|=1;
	}
//	SW_ID=~SW_ID;
	//3)***************返回获取的ID值
	return (SW_ID);

}
void Self_Test(u16 time)			//拔码开关为0时，计数显示测试
{
//	//************CAN通讯数据
//#define	CAN_ID				PC004V10_Num[8]*10+PC004V10_Num[9]		//单元地址	由两位数合并，十位为层，个位为序号
//#define	CAN_Command		PC004V10_Num[5]												//命令类型----上位机用户码
//#define	Data_H				PC004V10_Num[11]											//数据高位
//#define	Data_L				PC004V10_Num[12]											//数据低位
//	Self_Dsp=0;							//拔码开关为0时，自检测试显示标识变量
	if((time%10==0)&&(Self_Dsp==0))
	{
		PC004V10_Num[5]=0x05;				//命令类型----上位机用户码
		
//		PC004V10_Num[12]++;
		if(PC004V10_Num[12]++>=99)
		{
			PC004V10_Num[12]=0;
			if(PC004V10_Num[11]++>=9)
			{
				PC004V10_Num[11]=0;
				if(PC004V10_Num[9]++>=3)
				{
					PC004V10_Num[9]=0;
					if(PC004V10_Num[8]++>=5)
					{
						PC004V10_Num[8]=1;
						PC004V10_Num[9]=0;
						PC004V10_Num[11]=0;
						PC004V10_Num[12]=0;
						Self_Dsp=1;							//拔码开关为0时，自检测试显示标识变量，1--显示ID
						SYSTime=0;
					}
				}
			}
		}		
		PC004V10_CAN_TX();					//CAN发送数据，地址，命令类型，数据
	}
	else if(Self_Dsp==1)
	{
		if(time<5)
		{
			PC004V10_Num[5]=0x04;				//命令类型----显示ID
//			PC004V10_CAN_TX();				//CAN发送数据，地址，命令类型，数据
			PC004V10_CAN_COMMAD();			//CAN发送命令函数，地址，命令类型，数据--时间同步
		}
		else if(time>=9999)
		{
			PC004V10_Num[5]=0x05;				//命令类型----上位机用户码
			PC004V10_Num[8]=1;
			PC004V10_Num[9]=0;
			PC004V10_Num[11]=0;
			PC004V10_Num[12]=0;
			PC004V10_CAN_COMMAD();			//CAN发送命令函数，地址，命令类型，数据--时间同步
			Self_Dsp=0;									//拔码开关为0时，自检测试显示标识变量，0--计数
		}
	}
}

/*******************************************************************************
* 函数名		:
* 功能描述	: 
* 输入			: 无
* 输出			: 无
* 返回			: 无
*******************************************************************************/
void PC004V10_delay(u16 time)
{
	while(time--);
}



#endif
